app/views/admin/items/edit.html.erb

      <div class="col-auto"><%= f.label :"ジャンル", class: 'col-form-label' %></div>
      <div class="col-auto align-self-center"><%= f.collection_select :genre_id, Genre.all, :id, :name, prompt: "-- 選択して下さい --", class: 'form-control' %></div>
---
SELECT "genres".* FROM "genres"