app/controllers/admin/customers_controller.rb

  def index
    #カスタマー一覧用の情報を取得する
    @customers = Customer.page(params[:page]).reverse_order
---
SELECT "customers".* FROM "customers" ORDER BY "customers"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]

  def show
    #カスタマーモデルから一つのデータをみるけてくる（IDを使う）
    @customer = Customer.find(params[:id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    #カスタマーモデルから一つのデータをみるけてくる（IDを使う）
    @customer = Customer.find(params[:id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]