app/controllers/admin/genres_controller.rb

  def create
    @genre = Genre.new(genre_params)
    @genre.save
---
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ケーキ"], ["created_at", "2022-04-30 12:56:41.127856"], ["updated_at", "2022-04-30 12:56:41.127856"]]

  def update
    @genre = Genre.find(params[:id])
    @genre.update(genre_params)
---
SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "焼き菓子"], ["updated_at", "2022-05-08 03:15:39.102774"], ["id", 1]]