app/controllers/admin/items_controller.rb

INSERT INTO "items" ("name", "introduction", "price", "created_at", "updated_at", "genre_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "洋梨のチーズケーキタルト"], ["introduction", "美味しい"], ["price", 1], ["created_at", "2022-04-30 13:34:31.031358"], ["updated_at", "2022-04-30 13:34:31.031358"], ["genre_id", 1]]
---
  def create
    @item = Item.new(item_params)
    if @item.save

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "f660a253e8603245d8bd43e66ddd4a31ae8fa43990602050892b852d7bb2"], ["updated_at", "2022-05-09 15:17:16.541314"], ["id", 1]]
---
  def update
    @item = Item.find(params[:id])
    if @item.update(item_params)