app/controllers/admin/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 4]]
---
  def show
    @order = Order.find(params[:id])
    @order_items = @order.order_items.all

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "orders" SET "order_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_status", 1], ["updated_at", "2022-05-11 15:05:53.909212"], ["id", 4]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 4]]
UPDATE "order_items" SET "production_status" = ?, "updated_at" = ? WHERE "order_items"."id" = ?  [["production_status", 1], ["updated_at", "2022-05-11 15:05:53.922270"], ["id", 2]]
---
  def update
    @order = Order.find(params[:id])
    @order.update(order_params)
    @orders_items = @order.order_items

      if @order.order_status == "入金確認"
        #　紐付く注文ステータスが入金確認になったら
        @orders_items.each do |order_item|
        # 注文商品の各商品の制作ステータスを制作待ちにして更新
          order_item.update(production_status: 1)