app/controllers/admin/order_items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "orders" SET "order_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_status", 1], ["updated_at", "2022-05-11 15:06:00.987476"], ["id", 4]]
UPDATE "order_items" SET "production_status" = ?, "updated_at" = ? WHERE "order_items"."id" = ?  [["production_status", 2], ["updated_at", "2022-05-11 15:06:00.973333"], ["id", 2]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."production_status" = ?  [["order_id", 4], ["production_status", 2]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."production_status" = ?  [["order_id", 4], ["production_status", 3]]
---
  def update
      @order_item = OrderItem.find(params[:id])
      @order = @order_item.order
      @order_items = @order.order_items
      @order_item.update(order_items_params)

      if @order_items.where(production_status: "製作中").count >= 1
        # 紐付く注文商品の制作ステータスが１つでも製作中になったら注文ステータスを製作中にして更新する
        @order.update(order_status: 1)
      end

      if @order.order_items.count == OrderItem.where(order_id: @order, production_status: "制作完了").count