app/views/admin/orders/show.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 4]]
---
              <%= form_with model:order_item, url:admin_order_item_path(order_item.id),method: :patch, local: true do |f| %>
                <td><%= f.select :production_status, OrderItem.production_statuses.keys %></td>