app/views/admin/homes/top.html.erb

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT SUM("order_items"."quantity") FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 4]]
---
            <td><%= link_to order.created_at.strftime('%Y/%m/%d %H:%M:%S'), admin_order_path(order) %></td>
            <td><%= order.customer.last_name %> <%= order.customer.first_name %></td>
            <td><%=  order.order_items.sum(:quantity) %></td>