app/controllers/public/cart_items_controller.rb

  def index
    #会員idがログイン中のユーザーidのレコードを全て取得する
    @cart_items = CartItem.where(customer_id: current_customer)
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]

  def create
    #フォームから値を受け取る
    @cart_items = CartItem.new(cart_item_params)
    #既存のデータ内に追加しようとしている商品があればレコードを取得する
    @cart_item_update = CartItem.find_by(customer_id: current_customer, item_id: @cart_items.item_id )
    #レコードが取得できれば
    if @cart_item_update
      #既存のレコードの数量にフォームから受け取った値を加える
      new_amounts = @cart_item_update.amount + @cart_items.amount
      #数値が10を超える場合は10に値を固定させる
      if new_amounts >= 10
        new_amounts = 10
      end
      #既存のレコードの数量のみ更新
      @cart_item_update.update_attribute(:amount, new_amounts)
      #フォームから受け取った情報は使用しないので削除する
      @cart_items.delete
    else
      #新しくデータを保存する
      @cart_items.save
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["customer_id", 1], ["item_id", 1], ["LIMIT", 1]]
INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 1], ["customer_id", 1], ["amount", 1], ["created_at", "2022-05-08 03:19:55.911962"], ["updated_at", "2022-05-08 03:19:55.911962"]]

  def update
    @cart_item = CartItem.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy_all
    #ログイン中のユーザーに紐づいているデータを全て削除
    CartItem.where(customer_id: current_customer).destroy_all
---
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]