app/controllers/public/delivery_addresses_controller.rb

SELECT "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."customer_id" = ?  [["customer_id", 1]]
---
  def index
    #新規登録用のインスタンス変数
    @new_delivery_address = DeliveryAddress.new
    #登録されている配送先の取得
    @delivery_addresses = DeliveryAddress.where(customer_id: current_customer)

INSERT INTO "delivery_addresses" ("customer_id", "post_code", "address", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 1], ["post_code", "1200002"], ["address", "東京都足立区中川1-1"], ["name", "池田周平"], ["created_at", "2022-05-01 13:09:44.518227"], ["updated_at", "2022-05-01 13:09:44.518227"]]
---
  def create
    #POSTで受け取った配送先の情報をストロングパラメータを使って取得
    @delivery_addresses = DeliveryAddress.new(delivery_params)
    #customer_idの値にcurrent_customer(ログイン中)のidを入れる
    @delivery_addresses.customer_id = current_customer.id
    #取得した情報を元に保存
    if @delivery_addresses.save

SELECT "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    #編集対象の配送先のidを元にテーブルからデータを取得する
    @delivery_address = DeliveryAddress.find(params[:id])

SELECT "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    #編集対象の配送先のidを元にテーブルからデータを取得する
    @delivery_address = DeliveryAddress.find(params[:id])

SELECT "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "delivery_addresses" WHERE "delivery_addresses"."id" = ?  [["id", 1]]
---
  def destroy
    #削除対象の配送先のidを元にテーブルからデータを取得する
    @delivery_address = DeliveryAddress.find(params[:id])
    #対象データの削除を行う
    @delivery_address.destroy