app/controllers/public/homes_controller.rb

  def top
    @items = Item.where(sales_status: true).page(params[:page]).reverse_order.per(4)
---
SELECT "items".* FROM "items" WHERE "items"."sales_status" = ? ORDER BY "items"."id" DESC LIMIT ? OFFSET ?  [["sales_status", 1], ["LIMIT", 4], ["OFFSET", 0]]