app/controllers/public/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."sales_status" = ? LIMIT ? OFFSET ?  [["sales_status", 1], ["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items" WHERE "items"."sales_status" = ?  [["sales_status", 1]]
---
  def index
    @items = Item.where(sales_status: true).page(params[:page]).per(8)