app/controllers/public/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 1]]
---
  def index
    @orders = Order.where(customer_id: current_customer)

SELECT "delivery_addresses".* FROM "delivery_addresses" WHERE "delivery_addresses"."customer_id" = ?  [["customer_id", 1]]
---
  def new
    @order = Order.new
    @address = DeliveryAddress.where(customer_id: current_customer)

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."customer_id" = ? LIMIT ?  [["customer_id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("customer_id", "shipping_fee", "total_price", "delivery_postcode", "delivery_address", "delivery_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "order_items" ("order_id", "item_id", "price_on_purchase", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 3], ["item_id", 1], ["price_on_purchase", 1], ["quantity", 1], ["created_at", "2022-05-08 07:16:07.060596"], ["updated_at", "2022-05-08 07:16:07.060596"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 3]]
---
  def create
    @order = Order.new(order_params)
    @cart_items = CartItem.where(customer_id: current_customer)
    if @cart_items.exists?
      @order.save
      @cart_items.each do |item|
        OrderItem.create(
          order_id: @order.id,
          item_id: item.item.id,
          price_on_purchase: item.item.price,
          quantity: item.amount
        )
      end
      CartItem.where(customer_id: current_customer).destroy_all

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
---
  def show
    if params[:id] == 'confirm'
      redirect_to new_order_path
    else
      @order = Order.find(params[:id])
      @order_item = OrderItem.where(order_id: @order)

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
---
  def confirm
    @order = Order.new(order_params)
    @select_address = params[:order][:select_address]
    #自分の住所を選んだ時
    if @select_address == '0'
      @order.delivery_postcode = current_customer.post_code
      @order.delivery_address = current_customer.address
      @order.delivery_name = current_customer.last_name + current_customer.first_name
    #既存の住所を選んだ時
    elsif @select_address == '1'
      if params[:order][:delivery_address_id].presence
        @address = DeliveryAddress.find(params[:order][:delivery_address_id])
        @order.delivery_postcode = @address.post_code
        @order.delivery_address = @address.address
        @order.delivery_name = @address.name
      end
    end
    #既存の住所を選んだ時,配送先の情報が入っているか確認する
    if @order.delivery_postcode.presence && @order.delivery_address.presence && @order.delivery_name.presence
      @cart_items = CartItem.where(customer_id: current_customer)