app/views/public/orders/index.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
---
        <td>
          <% OrderItem.where(order_id: order).each do |item| %>